0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// nut = k / omega = 3.75e-3 / 160 = 2.34e-5 m^2/s  (turbulent viscosity)

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 2.34e-5;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 2.34e-5;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    topWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    bottomWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    stepWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    stepTop
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
