0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// omega = sqrt(k) / (Cmu^0.25 * L)
// L (turbulent length scale) = 0.07 * h = 0.07 * 0.01 = 7e-4 m
// omega = sqrt(3.75e-3) / (0.09^0.25 * 7e-4) = 0.0612 / (0.5477 * 7e-4) ≈ 160 s^-1

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 160;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 160;
    }

    outlet
    {
        type            zeroGradient;
    }

    topWall
    {
        type            omegaWallFunction;
        value           uniform 160;
    }

    bottomWall
    {
        type            omegaWallFunction;
        value           uniform 160;
    }

    stepWall
    {
        type            omegaWallFunction;
        value           uniform 160;
    }

    stepTop
    {
        type            omegaWallFunction;
        value           uniform 160;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
